Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: མཐའ་ཡས་བཟང་པོ་དང་། ཚུལ་དང་འདྲ་བའི་གཟུངས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་མཐོ་བའི་ལྷ་དག་སྟེ། རིགས་ཀྱི་བུ་དེ་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་ལ་སྩོགས་ཏེ། སྨོས་པ་འདི་དག་ལ་སྩོགས་པ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུམ་དུའང་ཁོ་མོ་ཉིད་འགྱུར་རོ། །
en: “Noble one, in that way I will be the mother of all the future tathāgatas, such as Maitreya and the others I have mentioned, and all the other tathāgata arhat samyak­saṃbuddhas of this Bhadra kalpa in this great world realm of a thousand million worlds.

source: འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་ཏེ།
en: “As it is in this world realm, I will in the same way enter countless world realms in the ten directions throughout the vast extent, without middle or center, of the ways of the realm of phenomena.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་ཡུམ་དུ་ཡོན་ཏན་གྱི་ཁྱད་པར་བརྗོད་དུ་མེད་པས་འགྱུར་བ་དེ་བཞིན་དུ་ཡོན་ཏན་གྱི་ཁྱད་པར་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པས་དེ་བཞིན་གཤེགས་པ་སེང་གེ་ནས་དེ་བཞིན་གཤེགས་པ་སྣང་བའི་བར་གྱི་ཡུམ་དུ་འགྱུར་རོ། །
en: “In the same way that I will be the mother, with countless special qualities, of the Tathāgata Maitreya, I will be the mother, with countless numbers of countless special qualities, of the Tathāgata Siṃha, and so on until the Tathāgata Roca.

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བསྐལ་བ་བཟང་པོ་བ་རྣམས་ཀྱི་ཡུམ་དུའང་འགྱུར་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་གཞི་དང་སྙིང་པོ་མེ་ཏོག་གི་རྒྱན་གྱིས་བརྒྱན་པ་འདི་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་འཛམ་བུ་གླིང་ཡོད་པ་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱད་པ་སྤྱོད་ཅིང་བསྐལ་པ་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱིན་གྱིས་བརླབས་ཏེ། མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་བ་ཐམས་ཅད་ཀྱི་ཡུམ་དུ་ཡང་འགྱུར་རོ། །
en: “Just as I am the mother of the tathāgatas of the Bhadra kalpa, in the same way, in all the Jambudvīpas in all the world realms in the entirety of this ocean of world realms called Kusuma­tala­garbha­vyūhālaṃkāra, and in all the world realms throughout the vast extent of world realms, until the last of future kalpas, I will practice the completely good conduct of the bodhisattva and be present in all kalpas in order to ripen and guide beings, and I will be the mother of all the tathāgatas as bodhisattvas in the future.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་མོ་སྒྱུ་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་འདི་བརྙེས་ནས་ཇི་སྲིད་ཅིག་ལགས།
en: After she had spoken, Sudhana, the head merchant’s son, asked Māyādevī, “Āryā, how long has it been since you attained this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་སྔོན་འདས་པའི་དུས་བསྐལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ། སེམས་ཀྱི་ཡུལ་ལས་འདས་པ་རིགས་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་མིག་གི་ལམ་གྱིས་རྣམ་པར་དམིགས་པ་རྣམ་པར་ཤེས་པས་བགྲང་བ་ལས་ཡོངས་སུ་འདས་པའི་ཕ་རོལ་ཅིག་ཏུ་བསྐལ་པ་དགེ་བའི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: Māyādevī answered, “Noble one, in the past, in time gone by, countless kalpas ago, beyond the scope of the mind, beyond kalpas that are beyond the number that can be perceived and known by the vision of wise bodhisattvas, there was a kalpa called Śubhaprabha.

source: བསྐལ་པ་དགེ་བའི་འོད་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རི་བོ་ཤིན་ཏུ་མཐོ་བའི་དཔལ་ཞེས་བྱ་བ་རྣམ་པར་དག་ལ་ཀུན་ནས་ཉོན་མོངས་པ་རིན་པོ་ཆེ་དུ་མ་ལས་གྲུབ་པ་ཁོར་ཡུག་དང་བཅས་པ་རི་རབ་དང་རྒྱ་མཚོར་བཅས་པ། འགྲོ་བ་ལྔའི་རྒྱུད་དང་བཅས་པ། སྣ་ཚོགས་བལྟ་ན་མཛེས་པ་ཞིག་བྱུང་སྟེ།
en: In that Śubhaprabha kalpa there was a world realm called Merūdgataśrī, which was both pure and defiled, formed from many jewels, and endowed with Cakravāla mountain ranges, Sumeru mountains, and oceans, the five classes of beings, and a variety of beauties.

source: འཇིག་རྟེན་གྱི་ཁམས་རི་བོ་ཤིན་ཏུ་མཐོ་བའི་དཔལ་དེར་གླིང་བཞི་པ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་བྱུང་སྟེ།
en: In that Merūdgataśrī world realm there were ten thousand million four-continent worlds.

source: གླིང་བཞི་བ་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་པོ་དེ་དག་གི་དབུས་ན་གླིང་བཞི་པ་དབུ་མ་སེང་གེ་རྒྱལ་མཚན་དམ་པའི་གཟི་བརྗིད་ཅེས་བྱ་བ་ཞིག་ཡོད་པར་གྱུར་ཏེ།
en: In the center of those ten thousand million four-continent worlds was the central four-continent world called Siṃha­dhvajāgra­tejas.

source: གླིང་བཞི་བ་དེར་རྒྱལ་པོའི་གནས་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་བྱུང་བར་གྱུར་ཏོ། །
en: In that four-continent world there were eighty thousand million royal cities.

source: རྒྱལ་པོའི་གནས་བྱེ་བ་བརྒྱ་ཕྲག་བརྒྱད་ཅུ་པོ་དེ་དག་གི་དབུས་སུ་རྒྱལ་པོའི་གནས་དབུ་མ་རྒྱལ་མཚན་གྱི་དམ་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་བྱུང་སྟེ། དེར་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བ་བྱུང་ངོ་། །
en: In the center of those eighty thousand million royal cities there was the central royal city, called Dhvajāgravatī, in which there was a cakravartin king called Mahā­tejaḥ­parākrama.

source: རྒྱལ་པོའི་གནས་རྒྱལ་མཚན་གྱི་དམ་པ་དང་ལྡན་པ་དེར་སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་ཅེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེ་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བ་འདུག་འདུག་གོ །
en: By that royal city of Dhvajāgravatī there was a bodhimaṇḍa called Citra­mañjari­prabhāsa, where dwelled a bodhimaṇḍa goddess by the name of Netraśrī.

source: སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་མཚན་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་ཞིག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་འདུག་པ་ལས་དེའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཆོས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་བར་ཆད་བྱ་བའི་ཕྱིར་བདུང་ཁ་དོག་བཟང་པོའི་འོད་ཅེས་བྱ་བ་བདུད་ཀྱི་སྡེ་ཆེན་པོའི་འཁོར་དང་ལྡན་པ་ཞིག་ལུས་མི་སྣང་བར་མ་བྱས་པར་དྲུང་དུ་ཕྱིན་པར་གྱུར་ཏོ། །
en: “In that bodhimaṇḍa called Citra­mañjari­prabhāsa, the bodhisattva Vimala­dhvaja sat in order to realize omniscience. In order to prevent his realization of omniscience, a māra by the name of Suvarṇaprabha, together with an entourage of a great army of māras, made himself visible and came before him.

source: འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐོབ་པའི་རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་ཞིག་སྟེ། དེས་བདུད་ཀྱི་སྡེ་དེ་བས་ཀྱང་འཕགས་ལ་ཆེས་མང་བའི་དཔུང་གི་ཚོགས་ཆེན་པོ་མངོན་པར་སྤྲུལ་ཏེ།
en: “The cakravartin Mahā­tejaḥ­parākrama had attained the power of a bodhisattva and displayed manifestations of great miraculous powers.

source: བདུད་ཀྱི་སྡེ་ཕམ་པར་བྱ་བའི་ཕྱིར་སྙིང་པོ་བྱང་ཆུབ་དེའི་འཁོར་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ་དང་། དེས་བདུད་ཀྱི་སྡེ་ཆེན་པོ་དེ་ཡང་རྣམ་པར་གཏོར་བར་གྱུར་ཏེ།
en: He manifested a great army that was far more numerous than the māra’s army, and in order to defeat the māra’s army, it surrounded the bodhimaṇḍa and scattered the great army of the māra.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱལ་མཚན་དྲི་མ་མེད་པ་དེས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: Then the Bhagavat, the Tathāgata Vimala­dhvaja, attained the highest, complete enlightenment of buddhahood.

source: དེ་ནས་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་གྱིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ལ་བུའི་འདུ་ཤེས་བསྐྱེད་ནས།
en: “Netraśrī, the bodhimaṇḍa goddess, looked upon the cakravartin king Mahā­tejaḥ­parākrama as her son.

source: དེ་བཞིན་གཤེགས་པ་དེའི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ནས་སྨོན་ལམ་བཏབ་པ། བཅོམ་ལྡན་འདས་བདག་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་འདི་བདག་གི་བུར་གྱུར་ཅིག །
en: She bowed to the feet of the Bhagavat and made this prayer: ‘Bhagavat, wherever I am reborn, may the cakravartin Mahā­tejaḥ­parākrama always be my son!

source: ནམ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེའི་ཚེའང་། བདག་ཉིད་དེའི་མར་གྱུར་ཅིག །
en: May I be his mother when he attains the highest, complete enlightenment at buddhahood.’

source: ཅེས་ནས་དེས་སྨོན་ལམ་དེ་སྐད་དུ་བཏབ་སྟེ། སྙིང་པོ་བྱང་ཆུབ་ཡལ་ག་སྣ་ཚོགས་ཀྱི་འོད་དེ་ཉིད་ལ་གནས་ཤིང་བསྐལ་བ་འོད་བཟང་པོ་དེ་ཉིད་ལ་དེ་བཞིན་གཤེགས་པ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་བསྙེན་བཀུར་ཏོ། །
en: “She dwelled at the Citra­mañjari­prabhāsa bodhimaṇḍa serving a trillion tathāgatas during the Śubhaprabha kalpa.

source: དེའི་ཚེ་དེའི་དུས་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was Netraśrī, the bodhimaṇḍa goddess?

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོ་མིག་གི་དཔལ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Noble one, do not think that it was anyone else, for at that time, in that time, I was Netraśrī, the bodhimaṇḍa goddess.

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐོབ་པ། རྫུ་འཕྲུལ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་བདུད་ཀྱི་སྡེ་ཆེན་པོ་རྣམ་པར་འཐོར་བར་བྱེད་བྱེད་པ་དེ་གཞན་ཞིག་ཡིན་པ་ཙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མི་བལྟ་སྟེ།
en: At that time, in that time, who was the cakravartin king Mahā­tejaḥ­parākrama, who had attained the power of a bodhisattva, displayed manifestations of great miraculous powers, and scattered the army of that māra?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་སྣང་མཛད་འདི་ནི་དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་གཟི་བརྗིད་ཆེན་པོའི་མཐུ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Do not think that it was anyone else, for at that time, in that time, the Tathāgata Arhat Samyak­saṃbuddha Vairocana was Mahā­tejaḥ­parākrama, the cakravartin king.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་དེ་ནས་ཉེ་བར་བཟུང་ནས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་དུའང་འདི་ནི་ཁོ་མོའི་བུར་གྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་ཅིང་འགྲོ་བའི་རྒྱུད་ཀྱི་སྒོ་ཐམས་ཅད་དང་། སྐྱེ་གནས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དགེ་བའི་རྩ་བའི་སྒོ་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྒྱུད་ཀྱི་ཚུལ་ཐམས་ཅད་དང་།
en: “Noble one, in that way, from that time onward, wherever I was reborn, in all those lives he has been my son.

source: སྐྱེས་པའི་རབས་ཀྱི་ཚུལ་ཐམས་ཅད་དང་། ལྷའི་དབང་པོའི་ཚེ་ཐམས་ཅད་དང་། འཇིག་རྟེན་གྱི་དབང་པོའི་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་དང་། དབང་ཕྱུག་གི་ས་ཐམས་ཅད་དང་། འགྲོ་བའི་རྒྱུད་དུ་སྣང་བ་ཐམས་ཅད་གང་དང་གང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་དུ་ཡང་ཁོ་མོ་ཉིད་འདིའི་ཡུམ་དུ་གྱུར་ཏེ།
en: Wherever he was reborn, practicing bodhisattva conduct in all buddha realms, in all the entrances to roots of merit, in all the ways of bodhisattva conduct, in all the ways of rebirth, in all lifetimes as a lord of devas, as a lord of the world, on the level of a supreme deity, as a light among the classes of beings, wherever he was reborn in order to ripen beings, in all those lifetimes I was his mother.

source: སྲིད་པ་ཐམས་ཅད་དུ་ཡང་ཁོ་མོ་ཉིད་དང་འབྲལ་བ་མེད་པར་ཡུམ་དུ་གྱུར་ཏོ། །
en: In all existences I have inseparably been his mother.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་སྒོ་ཐམས་ཅད་དུ་སྐད་ཅིག་སྐད་ཅིག་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་བསྟན་པར་གྱུར་བ་དེ་དག་ཐམས་ཅད་དུའང་ཁོ་མོ་ཉིད་འདིའི་ཡུམ་དུ་གྱུར་ཏོ། །
en: I have been his mother in all the miraculous bodhisattva births manifested in each instant through the gateways of bodhisattva births.

source: འདས་པའི་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པ་དག་གི་ཡུམ་དུའང་ཁོ་མོ་གྱུར་ཏོ། །
en: “I have been the mother of the immeasurable vast extent, without middle or end, of the tathāgatas of the past.

source: ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་བྱུང་བ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པ་དག་གི་ཡུམ་དུ་ཡང་ཁོ་མོ་གྱུར་ཏེ།
en: I am the mother of the immeasurable vast extent, without middle or end, of the tathāgatas in the ten directions who have appeared in the present time.

source: དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་གི་སྲིད་པ་ཐ་མ་ལ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་སྐུ་ལྟེ་བའི་དཀྱིལ་འཁོར་ནས་འོད་ཟེར་མང་པོ་བྱུང་ཞིང་ཁོ་མོའི་ལུས་དང་སེམས་རབ་ཏུ་སྣང་བར་མཛད་དོ། །
en: In that way, I have been the mother of a bodhisattva for all tathāgatas in their final lifetime, and from the navel of all those tathāgatas shone many light rays that illuminated my body and mind.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer.

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྙིང་པོ་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བས་མི་ངོམས་པའི་ལྟོ་ཅན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ།
en: How could I know or describe the qualities of the bodhisattvas who possess the essence of great compassion, who within themselves are never satisfied in ripening and guiding beings to omniscience, and who manifest from the tips of their body hairs the miraculous manifestations of all tathāgatas?

source: བ་སྤུའི་རྩེ་མོ་ལས་འབྱུང་བར་སྟོན་པ་ལ་དབང་བསྒྱུར་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་དེ་ཉིད་ན་ལྷའི་བུ་དྲན་པ་དང་ལྡན་པའི་བུ་མོ་ལྷ་དབང་འོད་ཅེས་བྱ་བ་འདུག་གིས།
en: In the paradise of the lord of Trāyastriṃśa resides Surendrābhā, the daughter of the deva Smṛtimat.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །
en: Go to her and ask her, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ལྷ་མོ་སྒྱུ་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ་ལྷ་མོ་སྒྱུ་མའི་དྲུང་ནས་སོང་ངོ་།། །།
en: Sudhana, the head merchant’s son, bowed his head to the feet of Māyādevī, circumambulated her many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from Māyādevī.

source: སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅུ་བདུན་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་གང་ན་བ་དང་། ལྷའི་བུ་དྲན་པ་དང་ལྡན་པའི་བུ་མོ་ལྷ་དབང་འོད་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Surendrābhā Chapter 45 Sudhana went to the paradise of the lord of Trāyastriṃśa and approached the deva maiden Surendrābhā, the daughter of the deva Smṛtimat.

source: ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་ལྷ་མོ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: He bowed his head to the feet of the deva maiden Surendrābhā, circumambulated the deva maiden Surendrābhā many hundreds of thousands of times, keeping her to his right, and then stood before the deva maiden Surendrābhā with his palms together in homage and said, “Āryā, goddess, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ། འཕགས་མ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Āryā, I have heard that you give instruction and teachings to bodhisattvas!

source: འཕགས་མ་ལྷ་མོ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་ཞེས་བྱ་བ་ཐོབ་པ་སྟེ།
en: When he had said that, the deva maiden Surendrābhā said to Sudhana, the head merchant’s son, “Noble one, I have attained the bodhisattva liberation called the display of pure, unimpeded memory.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་མངོན་པར་དྲན་པ་བསྐལ་པ་ཨུད་པ་ལ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏེ།
en: “Noble one, I remember a kalpa called Utpala in which I served as many tathāgatas as there are grains of sand in the Ganges River.

source: དེ་དག་མངོན་པར་བྱུང་བའི་ཚེའང་ཡོངས་སུ་བསྲུང་བ་བྱས་སོ། །མཆོད་པ་བྱས་སོ། །ལོངས་སྤྱོད་པའི་དོན་དུ་བཟའ་ཤིང་གི་ར་བ་གསོལ་ཏོ། །
en: When they set forth, I protected them, made offerings to them, and gave them parks to enjoy.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཏེ། ཡུམ་གྱི་སྐུ་ན་བཞུགས་པ་དང་། བལྟམ་པ་དང་གཤེགས་སྟབས་བདུན་དུ་བཞུད་པ་དང་། སེང་གེའི་ང་རོ་ཆེན་པོ་སྒྲོགས་པ་དང་། གཞོན་ནུའི་ས་ལ་བཞུགས་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པའམ། མངོན་པར་འབྱུང་བའམ། བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འམ། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའམ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་མཛད་པའི་ཚེ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་དང་། རྣམ་པར་གདུལ་བ་མཛད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཅད་དམ་པའི་ཆོས་མཐར་ཐུག་པར་ཟད་ཀྱི་བར་དུ་ཁོ་མོས་ཤེས་སོ། །
en: “I know when those buddha bhagavats were bodhisattvas, were within the bodies of their mothers, were born, took their first seven steps, roared the lion’s roar, were youths, were within their harems, set forth into homelessness, attained the enlightenment of buddhahood, turned the wheel of the Dharma, and displayed all the miraculous manifestations of a buddha, and when they ripened and guided beings, throughout all those times, from their first development of the aspiration for enlightenment until their final Dharma teaching.

source: དྲན་ནོ། །རྗེས་སུ་དྲན་ནོ། །བཟུང་ངོ་། །ཡོངས་སུ་བཟུང་ངོ་། །ཉེ་བར་བཟུང་ངོ་། །
en: I remember that, recollect that, grasp that, retain that, reflect upon that, and follow that.

source: རྗེས་སུ་འབྲང་བར་བྱེད་དོ། །བསྐལ་པས་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ། ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གདྒཱ་བཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Subhūti, in which I served as many tathāgatas as there are grains of sand in ten Ganges Rivers.

source: བསྐལ་པ་གྲགས་པ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Subhaga, in which I served as many tathāgatas as there are atoms in a buddha realm.

source: བསྐལ་པ་དམིགས་སུ་མེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Anilambha, in which I served eighty-four hundred thousand quintillion tathāgatas.

source: བསྐལ་པ་འོད་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Suprabha, in which I served as many tathāgatas as there are atoms in Jambudvīpa.

source: བསྐལ་པ་འོད་གཞལ་དུ་མེད་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་ཉི་ཤུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Atulaprabha, in which I served as many tathāgatas as there are grains of sand in twenty Ganges Rivers.

source: བསྐལ་པ་དཔལ་ཤིན་ཏུ་འབར་བ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Uttaptaśrī, in which I served as many tathāgatas as there are grains of sand in one Ganges River.

source: བསྐལ་པ་སྙིང་རྗེ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱ་བརྒྱད་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Sūryodaya, in which I served as many tathāgatas as there are grains of sand in eighty Ganges Rivers.

source: བསྐལ་པ་རྒྱལ་བར་གྱུར་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གངྒཱ་དྲུག་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Jayaṃgama, in which I served as many tathāgatas as there are grains of sand in sixty Ganges Rivers.

source: བསྐལ་པ་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བ་ཞིག་བྱུང་བ་དེ་ལ་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆུ་ཀླུང་གང་གཱ་བདུན་ཅུའི་བྱེ་མ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ། །
en: “There was a kalpa called Sucandra, in which I served as many tathāgatas as there are grains of sand in seventy Ganges Rivers.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཚུལ་དེ་བཞིན་དུ་ཁོ་མོ་རྟག་ཏུ་རྒྱུན་མ་ཆད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་བྲལ་བར་མ་གྱུར་པ་ནི་བསྐལ་པ་ཆུ་ཀླུང་གངྒཱའི་བྱེ་མ་སྙེད་ཅིག་དྲན་ཏེ།
en: “Noble one, in that way, I remember never being apart from the tathāgata arhat samyak­saṃbuddhas throughout kalpas as numerous as the grains of sand in the Ganges River.

source: ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་འདི་ཐོས་སོ། །
en: I heard from all those tathāgatas this bodhisattva liberation called the display of pure, unimpeded memory.

source: ཐོས་ནས་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་། །
en: I heard it and retained it.

source: ཇི་སྐད་དུ་གསུངས་པ་བཞིན་དུ་ཁོང་དུ་ཆུད་དོ། །
en: I comprehended whatever they said.

source: རྣམ་པར་ཐར་པ་འདི་ཉིད་ལ་ཁོ་མོ་རྟག་ཏུ་རྒྱུན་མ་ཆད་པར་རྗེས་སུ་ཞུགས་པར་གནས་གནས་ཏེ།
en: I have constantly, always remained within this liberation.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཉེ་བར་བཟུང་བ་ནས་དམ་པའི་ཆོས་གནས་པ་ཟད་པའི་མཐར་ཐུག་གི་བར་གྱི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་ལ་རྣམ་པར་དག་པས་བརྒྱན་པ་འདི་དྲན་ནོ། །
en: Through this bodhisattva liberation called the display of pure, unimpeded memory, I remember those tathāgatas from the time they attained the level of a bodhisattva until the time their Dharma ceased to exist.

source: རྗེས་སུ་དྲན་ནོ། །བཟུང་ངོ་། །ཡོངས་སུ་བཟུང་ངོ་། །ཉེ་བར་བཟུང་ངོ་། །རྗེས་སུ་འབྲང་བར་བྱེད་དོ། །
en: I recollect that, grasp that, retain that, reflect upon that, and follow that.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མུན་པའི་མུན་ནག་དང་བྲལ་བ། འཁོར་བའི་ནམ་ནངས་པ། སྒྲིབ་པ་དང་བྲལ་བ། གཉིད་མེད་པ་ལ་མོས་ཤིང་།
en: “Noble one, I know only this bodhisattva liberation called the display of pure, unimpeded memory.

source: དགའ་བ་སྙོམས་པ་དང་། ལེ་ལོ་རྣམ་པར་སྤངས་པ། ལུས་ཀྱི་འདུ་བྱེད་ཤིན་ཏུ་བྱང་བ། རྟག་པར་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་ཤིན་ཏུ་དག་པ། སྟོབས་བཅུ་རྣམ་པར་དག་པ་ཁོང་དུ་ཆུད་པ།
en: How could I know or describe the qualities of the bodhisattvas who are free from the blindness of darkness, who have risen out of saṃsāra, who are free of obscurations, who aspire not to be asleep, who are free of apathy and idleness, whose body formations are purified, who continuously understand the nature of all phenomena, and who have realized the pure ten strengths?

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ན་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ཞེས་བྱ་བ་འདུག་གིས།
en: In the great city of Kapilavastu resides a teacher of children by the name of Viśvāmitra.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། དགེ་བའི་རྩ་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཤུགས་དྲག་པོ་རྣམ་པར་འཕེལ་བས། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then Sudhana, the head merchant’s son, filled with joy, delighted, elated, pleased, and happy, bowed his head to the feet of the deva maiden Surendrābhā.

source: ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ལྷའི་བུ་མོ་ལྷ་དབང་འོད་ཀྱི་དྲུང་ནས་སོང་ངོ་། །
en: He circumambulated the deva maiden Surendrābhā many hundreds of thousands of times, keeping her to his right, and, looking back at her again and again, departed from the deva maiden Surendrābhā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སུམ་ཅུ་རྩ་གསུམ་གྱི་དབང་པོའི་གནས་ནས་བབས་ཏེ། མཐར་གྱིས་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་སུ་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་གང་ན་བ་དེར་སོང་སྟེ། ཕྱིན་ནས།
en: Viśvāmitra Chapter 46 Sudhana descended from the paradise of the lord of Trāyastriṃśa and eventually came to Viśvāmitra, the teacher of children, in the city of Kapilavastu.
